## Data Science

#### Oscar Hernández Terán. Geophysical engineer 

This workbook contains exercises from the Pandas library for files management. It runs on python3, specifically version 3.9.7.

In [1]:
# We import the library.
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
# Open and convert a file in a DataFrame.
datos = pd.read_csv('../DataBase/Data2.csv', sep = ';')
# All columns and first 5 rows.
datos.head(10)

,DATA,FORNECEDOR,DESTINO,ESTADO/MUNICIPIO,TIPO,QUANTIDADE,VALOR,DESTINATARIO,UF
0,19/04/2020,VYAIRE,RIO DE JANEIRO,ESTADO,UTI,40,2400000,ALMOXARIFADO ESTADUAL DE MEDICAMENTOS - RIO DE...,RJ
1,22/04/2020,VYAIRE,RIO DE JANEIRO,ESTADO,UTI,20,1200000,LABORATÓRIO QUÍMICO FARMACÊUTICO DE AERONÁUTICA,RJ
2,08/05/2020,MAGNAMED,RIO DE JANEIRO,ESTADO,UTI,25,1500000,ALMOXARIFADO ESTADUAL DE MEDICAMENTOS - RIO DE...,RJ
3,08/05/2020,KTK,RIO DE JANEIRO,ESTADO,UTI,15,900000,ALMOXARIFADO ESTADUAL DE MEDICAMENTOS - RIO DE...,RJ
4,09/05/2020,LEISTUNG,RIO DE JANEIRO,ESTADO,UTI,6,360000,ALMOXARIFADO ESTADUAL DE MEDICAMENTOS - RIO DE...,RJ
5,09/05/2020,VYAIRE,RIO DE JANEIRO,ESTADO,UTI,1,60000,ALMOXARIFADO ESTADUAL DE MEDICAMENTOS - RIO DE...,RJ
6,09/05/2020,VYAIRE,RIO DE JANEIRO,ESTADO,UTI,30,1800000,ALMOXARIFADO ESTADUAL DE MEDICAMENTOS - RIO DE...,RJ
7,09/05/2020,MAGNAMED,RIO DE JANEIRO,ESTADO,UTI,8,480000,ALMOXARIFADO ESTADUAL DE MEDICAMENTOS - RIO DE...,RJ
8,09/05/2020,MAGNAMED,RIO DE JANEIRO,ESTADO,TRANSPORTE,4,193160,ALMOXARIFADO ESTADUAL DE MEDICAMENTOS - RIO DE...,RJ
9,09/05/2020,MAGNAMED,RIO DE JANEIRO,ESTADO,UTI,1,60000,ALMOXARIFADO ESTADUAL DE MEDICAMENTOS - RIO DE...,RJ

In [3]:
# Last 3 rows.
datos.tail(3)

,DATA,FORNECEDOR,DESTINO,ESTADO/MUNICIPIO,TIPO,QUANTIDADE,VALOR,DESTINATARIO,UF
1602,24/09/2020,KTK,PARANA,MUNICIPIO,UTI,2,120000,SMS de GUAIRA,PR
1603,24/09/2020,VYAIRE LTV 2200 USA,PARANA,MUNICIPIO,TRANSPORTE USA,1,63125,SMS de GUAIRA,PR
1604,07/08/2020,MAGNAMED,LIBANO,-,TRANSPORTE,300,14487000,MISSÃO FAB (Doação Destino ao Libano).,-

In [4]:
# Command 'df.columns' for see a list with columns names.
print(datos.columns)

Index(['DATA', 'FORNECEDOR', 'DESTINO', 'ESTADO/MUNICIPIO', 'TIPO',
       'QUANTIDADE', 'VALOR', 'DESTINATARIO', 'UF'],
      dtype='object')

In [5]:
# Main information of DF.
datos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1605 entries, 0 to 1604
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   DATA              1605 non-null   object
 1   FORNECEDOR        1605 non-null   object
 2   DESTINO           1605 non-null   object
 3   ESTADO/MUNICIPIO  1605 non-null   object
 4   TIPO              1605 non-null   object
 5   QUANTIDADE        1605 non-null   int64
 6   VALOR             1605 non-null   int64
 7   DESTINATARIO      1605 non-null   object
 8   UF                1605 non-null   object
dtypes: int64(2), object(7)
memory usage: 113.0+ KB

In [6]:
# We check the shape of data.
datos.shape

(1605, 9)

In [7]:
# We check the types of variables for each column.
datos.dtypes

DATA                object
FORNECEDOR          object
DESTINO             object
ESTADO/MUNICIPIO    object
TIPO                object
QUANTIDADE           int64
VALOR                int64
DESTINATARIO        object
UF                  object
dtype: object

In [8]:
# We check if there are empty positions.
datos.isna().sum()

DATA                0
FORNECEDOR          0
DESTINO             0
ESTADO/MUNICIPIO    0
TIPO                0
QUANTIDADE          0
VALOR               0
DESTINATARIO        0
UF                  0
dtype: int64

In [9]:
# Add a date column.
datos['DATA'] = pd.to_datetime(datos['DATA'])

In [10]:
# We convert the data type.
datos['VALOR'] = datos['VALOR'].astype(float)

In [11]:
# We check wich values are not repetead.
datos['FORNECEDOR'].unique()

array(['VYAIRE', 'MAGNAMED', 'KTK', 'LEISTUNG', 'LEISTUNG/VYAIRE',
       'KTK/VAYIRE', 'WEG', 'VYAIRE LTV 2200 USA', 'UTI',
       'VYAIRE LTV 1200 USA', 'MAGNAMED-REQUISIÇÃO',
       'SUZANO/Zhongxun Medical', 'SUZANO/Resmed',
       'L C DADDE COM AT INST MAT MEDICO EPP', 'MAGNAMED/REQUISIÇÃO',
       'Leistung'], dtype=object)

In [12]:
datos['TIPO'].unique()

array(['UTI', 'TRANSPORTE', 'TRANSPORTE USA', 'Transporte'], dtype=object)

In [13]:
# '.size' return the value of size.
datos['DESTINATARIO'].unique().size

944

In [14]:
# We can save the DF with a different extension
#datos.to_excel('respirators_distribution_Brazil-modified.xlsx')

In [15]:
# We load data.
datos2 = pd.read_csv('../DataBase/Data3.csv')
datos2.head()

  Product  Age  Gender  Education MaritalStatus  Usage  Fitness  Income  Miles
0   TM195   18    Male         14        Single      3        4   29562    112
1   TM195   19    Male         15        Single      2        3   31836     75
2   TM195   19  Female         14     Partnered      4        3   30699     66
3   TM195   19    Male         12        Single      3        3   32973     85
4   TM195   20    Male         13     Partnered      4        2   35247     47

In [16]:
datos2.shape

(180, 9)

In [17]:
datos2.head(3)

  Product  Age  Gender  Education MaritalStatus  Usage  Fitness  Income  Miles
0   TM195   18    Male         14        Single      3        4   29562    112
1   TM195   19    Male         15        Single      2        3   31836     75
2   TM195   19  Female         14     Partnered      4        3   30699     66

In [18]:
datos2.tail(2)

,Product,Age,Gender,Education,MaritalStatus,Usage,Fitness,Income,Miles
178,TM798,47,Male,18,Partnered,4,5,104581,120
179,TM798,48,Male,18,Partnered,4,5,95508,180

In [19]:
datos2.dtypes

Product          object
Age               int64
Gender           object
Education         int64
MaritalStatus    object
Usage             int64
Fitness           int64
Income            int64
Miles             int64
dtype: object

In [20]:
datos2['Income'].astype(float)
datos2['Product'].unique()

array(['TM195', 'TM498', 'TM798'], dtype=object)

In [21]:
datos2['MaritalStatus'].unique()

array(['Single', 'Partnered'], dtype=object)

In [22]:
# We can count how many repeat values a variable has.
datos2['Gender'].value_counts()

Male      104
Female     76
Name: Gender, dtype: int64

In [23]:
# We can save the DF in a .json file.
#datos2.to_json('JSON.json')

In [24]:
# We load data for a link in format .html
datos3 = pd.read_html('https://en.wikipedia.org/wiki/Economy_of_the_United_States')[1]
datos3.to_csv('Economy.csv', sep = ';', index=False)
datos3.head()

,Year,Nominal GDP(billions USD),GDP per capita(USD),GDP growth(real),Inflation rate(in %),Unemployment(in %),Budget balance(in % of GDP)[106],Government debt held by public(in % of GDP)[107],Current accountbalance(in % of GDP)
0,2020 (est),20934.0,57589,−3.5 %,0.62 %,11.1 %,−n/a %,79.9 %,−n/a %
1,2019,21439.0,64674,2.2 %,1.8 %,3.5 %,−4.6 %,78.9 %,−2.5 %
2,2018,20611.2,62869,3.0 %,2.4 %,3.9 %,−3.8 %,77.8 %,−2.4 %
3,2017,19519.4,60000,2.3%,2.1 %,4.4 %,−3.4 %,76.1%,−2.3 %
4,2016,18715.0,57878,1.7 %,1.3 %,4.9 %,−3.1 %,76.4%,−2.3 %

In [25]:
datos4 = pd.read_csv('../DataBase/Data4.csv')
datos4.head()

,Domain Code,Domain,Area Code,Area,Element Code,Element,Item Code,Item,Year Code,Year,Unit,Value,Flag,Flag Description
0,QC,Crops,9,Argentina,5419,Yield,515,Apples,2016,2016,hg/ha,223912,Fc,Calculated data
1,QC,Crops,9,Argentina,5419,Yield,515,Apples,2017,2017,hg/ha,235386,Fc,Calculated data
2,QC,Crops,9,Argentina,5419,Yield,515,Apples,2018,2018,hg/ha,213072,Fc,Calculated data
3,QC,Crops,9,Argentina,5510,Production,515,Apples,2016,2016,tonnes,458908,NaN,Official data
4,QC,Crops,9,Argentina,5510,Production,515,Apples,2017,2017,tonnes,458908,NaN,Official data

In [26]:
datos4.shape

(66, 14)

In [27]:
datos4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 66 entries, 0 to 65
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Domain Code       66 non-null     object
 1   Domain            66 non-null     object
 2   Area Code         66 non-null     int64
 3   Area              66 non-null     object
 4   Element Code      66 non-null     int64
 5   Element           66 non-null     object
 6   Item Code         66 non-null     int64
 7   Item              66 non-null     object
 8   Year Code         66 non-null     int64
 9   Year              66 non-null     int64
 10  Unit              66 non-null     object
 11  Value             66 non-null     int64
 12  Flag              43 non-null     object
 13  Flag Description  66 non-null     object
dtypes: int64(6), object(8)
memory usage: 7.3+ KB

In [28]:
datos4.dtypes

Domain Code         object
Domain              object
Area Code            int64
Area                object
Element Code         int64
Element             object
Item Code            int64
Item                object
Year Code            int64
Year                 int64
Unit                object
Value                int64
Flag                object
Flag Description    object
dtype: object

In [29]:
# Command 'df.drop' for cut a DF.
datos4.drop(['Domain Code', 'Domain', 'Area Code', 
             'Element Code', 'Item Code', 'Year Code', 'Flag', 'Flag Description'], axis=1)

                        Area     Element      Item  Year    Unit     Value
0                  Argentina       Yield    Apples  2016   hg/ha    223912
1                  Argentina       Yield    Apples  2017   hg/ha    235386
2                  Argentina       Yield    Apples  2018   hg/ha    213072
3                  Argentina  Production    Apples  2016  tonnes    458908
4                  Argentina  Production    Apples  2017  tonnes    458908
..                       ...         ...       ...   ...     ...       ...
61  United States of America       Yield  Tomatoes  2017   hg/ha    886625
62  United States of America       Yield  Tomatoes  2018   hg/ha    968079
63  United States of America  Production  Tomatoes  2016  tonnes  12877049
64  United States of America  Production  Tomatoes  2017  tonnes  11141862
65  United States of America  Production  Tomatoes  2018  tonnes  12612139

[66 rows x 6 columns]

In [30]:
datos4['Value'].astype(float)

0       223912.0
1       235386.0
2       213072.0
3       458908.0
4       458908.0
         ...
61      886625.0
62      968079.0
63    12877049.0
64    11141862.0
65    12612139.0
Name: Value, Length: 66, dtype: float64

In [31]:
# Command for save a DF in a csv file.
#datos4.to_csv('FAOSTAT_data_12-5-2020_Modified.csv', sep=';', index=False)